package RoadMapStep2.topic5;

/**
 * Создайте Java-программу, которая использует цикл for для вывода чисел от 1 до 1000. Каждое число должно выводиться на новой строке.
 */
public class ForLoopPrint {
    public static void main(String[] args) {
        for (int i = 1; i <=1000; i++) {
            System.out.println(i);
        }
    }
}
